/*
Задача № 1
В интернет-магазинах у каждого товара есть название и цена.

На склад поступил первый товар. Нам нужно завести данные о нем в систему учета.

Процесс реализации:
Активируйте строгий режим соответствия;
Объявите две переменные:
название;
цена;
Пока не присваивайте никаких значений переменным.
Задача № 2
У поступившего товара — следующие характеристики:

Название: Телепорт бытовой VZHIH-101;
Цена: 10000;
По техническому заданию нам нужно выводить в консоль текст, из которого понятно, как называется товар и сколько он стоит в космических кредитах (Q).

Процесс реализации
Присвойте значения из описания товара соответствующим переменным.
Напишите 2 команды для вывода информации в консоль.
В первой строке должен выводиться текст: В наличии имеется: «Телепорт бытовой VZHIH-101»
Во второй строке должна выводиться цена товара в формате Стоимость товара 10000 Q
Используйте шаблоны для подстановки значений переменных в нужных местах.
Задача № 3
В магазине действует программа лояльности. При покупке 2 и более единиц товара предоставляется скидка 10 %. Посчитайте сумму покупки для компании, которая приобретает 2 телепорта.

Процесс реализации
Объявите переменные:
количество товаров;
размер скидки;
итоговая сумма оплаты;
Составьте выражение, используя переменные и математические операторы, и вычислите сумму скидки для покупателя при покупке двух телепортов.
Присвойте результат переменной.
Посчитайте, сколько должен будет заплатить покупатель, и выведите результат в консоль в виде Цена покупки составит X Q (где Х — вычисленное ранее значение).
Задача № 4. Дополнительная (необязательная)
Руководство интернет-магазина планирует крупную закупку телепортов. На счету фирмы есть 52334224 Q. Закупочная цена одного телепорта — 6500 Q. Сколько останется денег после закупки максимально возможной партии товара? Сколько единиц товара можно купить на имеющуюся сумму?

Процесс реализации
Используя оператор взятия остатка, вычислите, сколько денег останется у компании после закупки.
Вычислите, какое количество товаров будет куплено на предоставленную сумму.
Выведите результат в консоль в виде Мы можем закупить X единиц товара, после закупки на счету останется Y Q (где Х и Y — вычисленные ранее значения).



*/